app/controllers/application_controller.rb

    def current_shop
        @current_shop ||= Shop.find(session[:shop_id]) if session[:shop_id]
---
SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]