app/controllers/messages_controller.rb

    def create
        message = current_user.messages.build(message_params)
        if message.save
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "testing new message"], ["user_id", 2], ["created_at", "2020-05-21 11:00:34.063564"], ["updated_at", "2020-05-21 11:00:34.063564"]]