app/controllers/phones_controller.rb

SELECT "phones".* FROM "phones"
---
    def index
        @phones = Phone.all

SELECT "shops".* FROM "shops" ORDER BY "shops"."id" DESC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "phones" ("name", "description", "price", "updated_on", "shop_id") VALUES (?, ?, ?, ?, ?)  [["name", "oppo A7"], ["description", "oppo camera phone"], ["price", 18000], ["updated_on", "2020-06-08 20:35:52.750198"], ["shop_id", 2]]
---
    def create
        @phone = Phone.new(phone_params)
        @phone.shop = Shop.last
        if @phone.save

SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @phone = Phone.find(params[:id])

SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def edit
        @phone = Phone.find(params[:id])

SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "phones" SET "description" = ?, "updated_on" = ? WHERE "phones"."id" = ?  [["description", ""], ["updated_on", "2020-06-08 19:46:37.393120"], ["id", 1]]
---
    def update
        @phone = Phone.find(params[:id])
        if @phone.update(phone_params)

SELECT "phones".* FROM "phones" WHERE "phones"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "phones" WHERE "phones"."id" = ?  [["id", 7]]
---
    def destroy
        @phone = Phone.find(params[:id])
        if @phone.destroy