app/controllers/sessions_controller.rb

    def create
        shop = Shop.find_by(email: params[:session][:email])
---
SELECT "shops".* FROM "shops" WHERE "shops"."email" = ? LIMIT ?  [["email", "help@capitel.com"], ["LIMIT", 1]]