app/controllers/shops_controller.rb

INSERT INTO "shops" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
    def create
        @shop = Shop.new(shop_params)
        if @shop.save

UPDATE "shops" SET "about" = ?, "updated_at" = ? WHERE "shops"."id" = ?  [["about", ""], ["updated_at", "2020-06-09 16:09:54.342075"], ["id", 1]]
---
    def update

        if @shop.update(shop_params)

SELECT "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_shop
      @shop = Shop.find(params[:id])